# ------------------------------------
# パッケージ
# ------------------------------------

library(dplyr)
library(DT)
library(data.table)
library(stringr)
library(purrr)
library(tidyr)


# ------------------------------------
# データのインポート
# ------------------------------------


# 実際のファイル名を以下に代入する
file.name.2018 <- "2018_20200428.csv"
file.name.2019 <- "2019_20200428.csv"
file.name.2020 <- "2020_20200428.csv"

# 必要な列
cols <- c("研究課題/領域番号", "研究代表者", "研究分担者", "審査区分", "研究種目", 
          "研究機関", "総配分額", "総配分額 (直接経費)", "キーワード", "研究期間 (年度)")

# 2018年度データのインポート
d2018 <- fread(file.name.2018, select = cols) 
d2018[, 年度 := 2018]

# 2019年度データのインポート
d2019 <- fread(file.name.2019, select = cols) 
d2019[, 年度 := 2019]

# 2020年度データのインポート
d2020 <- fread(file.name.2020, select = cols) 
d2020[, 年度 := 2020]


# データの統合と整理
DF <- rbind(d2018, d2019, d2020) 
setnames(DF, "研究課題/領域番号", "研究課題番号")
setnames(DF, "総配分額 (直接経費)", "直接経費")


# -----------------------------
# データのクリーニング
# -----------------------------

# 所属機関の整理
DF[, 所属機関 := str_replace(研究機関, "(^.+/ )(.+?)", "\\2")]
DF[, 所属機関 := str_replace(所属機関, "\\(.*\\)", "")]    
DF[, 所属機関 := str_replace(所属機関, "^国立研究開発法人", "")]    
DF[, 所属機関 := str_replace(所属機関, "^大学共同利用機関法人", "")]  
DF[, 所属機関 := str_replace(所属機関, "^公益財団法人", "")]  
DF[, 所属機関 := str_replace(所属機関, "^独立行政法人", "")]    
DF[, 所属機関 := str_replace(所属機関, "^地方独立行政法人", "")]    
DF[, 所属機関 := str_replace(所属機関, "^一般財団法人", "")]    
DF[, 所属機関 := str_replace(所属機関, "株式会社", "")]    
DF[, 所属機関 := str_replace(所属機関, "大学$", "")]
DF[, 所属機関 := str_trim(所属機関, side = "both")]

# 研究者番号の取得
DF[, 代表ID := str_extract(研究代表者, "\\d{8}")]

#職名の整理
DF[, 職名 := str_replace(研究代表者, "(^.+, )(.+?)", "\\2")]
DF[, 職名 := str_replace(職名, "\\(.+\\)", "")]
DF[, 職名 := ifelse(str_detect(職名, "助教"), "助教", 職名)]
DF[, 職名 := ifelse(str_detect(職名, "講師"), "講師", 職名)]
DF[, 職名 := ifelse(str_detect(職名, "准教授"), "准教授", 職名)]
DF[, 職名 := ifelse(str_detect(職名, "(?<!准)教授"), "教授", 職名)]
DF[, 職名 := ifelse(!str_detect(職名,"助教|講師|准教授|教授"), "その他", 職名)]
    
# 審査区分カテゴリー
DF[, 区分 := str_extract(審査区分, "大区分|中区分|小区分")]
    
# 審査区分コード
DF[, 区分コード := ifelse(str_detect(審査区分, "中区分|小区分"), str_extract(審査区分, "\\d+?(?=:)"), NA)]
DF[, 区分コード := ifelse(str_detect(審査区分, "大区分"), str_replace(審査区分, "大区分", ""), 区分コード)]
    
# 審査区分名の整理
DF[, 区分名 := ifelse(str_detect(審査区分, "大区分|中区分|小区分"), str_replace(審査区分, "^.+?:", ""), "その他")]
DF[, 区分名 := str_replace(区分名, "およびその関連分野$", "")]
DF[, 区分名 := str_replace(区分名, "関連$", "")]
    
# 研究期間
DF[, 期間 := str_extract_all(`研究期間 (年度)`, "\\d{4}")]
DF[, 年数 := map_dbl(期間, function(x){
     if(length(unlist(x)) == 1){
         1
     } else {
         max(as.numeric(unlist(x))) - min(as.numeric(unlist(x)))
     }  
    }
    )]

# 不要な列の削除
DF[, c("研究期間 (年度)", "期間", "研究機関", "研究代表者", "審査区分") := NULL]
    

# -----------------------------
# ファイルの出力
# -----------------------------

fwrite(DF, "../99_cleaned_data/cleaned_df.csv")


